valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0W */
#define IFX_CAN_N_IR_RF0W_OFF (1u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0F */
#define IFX_CAN_N_IR_RF0F_OFF (2u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF0L */
#define IFX_CAN_N_IR_RF0L_OFF (3u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF1N */
#define IFX_CAN_N_IR_RF1N_OFF (4u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF1W */
#define IFX_CAN_N_IR_RF1W_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF1W */
#define IFX_CAN_N_IR_RF1W_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF1W */
#define IFX_CAN_N_IR_RF1W_OFF (5u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF1F */
#define IFX_CAN_N_IR_RF1F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF1F */
#define IFX_CAN_N_IR_RF1F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF1F */
#define IFX_CAN_N_IR_RF1F_OFF (6u)

/** \brief Length for Ifx_CAN_N_IR_Bits.RF1L */
#define IFX_CAN_N_IR_RF1L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.RF1L */
#define IFX_CAN_N_IR_RF1L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.RF1L */
#define IFX_CAN_N_IR_RF1L_OFF (7u)

/** \brief Length for Ifx_CAN_N_IR_Bits.HPM */
#define IFX_CAN_N_IR_HPM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.HPM */
#define IFX_CAN_N_IR_HPM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.HPM */
#define IFX_CAN_N_IR_HPM_OFF (8u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TC */
#define IFX_CAN_N_IR_TC_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TC */
#define IFX_CAN_N_IR_TC_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TC */
#define IFX_CAN_N_IR_TC_OFF (9u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TCF */
#define IFX_CAN_N_IR_TCF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TCF */
#define IFX_CAN_N_IR_TCF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TCF */
#define IFX_CAN_N_IR_TCF_OFF (10u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TFE */
#define IFX_CAN_N_IR_TFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TFE */
#define IFX_CAN_N_IR_TFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TFE */
#define IFX_CAN_N_IR_TFE_OFF (11u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TEFN */
#define IFX_CAN_N_IR_TEFN_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TEFN */
#define IFX_CAN_N_IR_TEFN_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TEFN */
#define IFX_CAN_N_IR_TEFN_OFF (12u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TEFW */
#define IFX_CAN_N_IR_TEFW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TEFW */
#define IFX_CAN_N_IR_TEFW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TEFW */
#define IFX_CAN_N_IR_TEFW_OFF (13u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TEFF */
#define IFX_CAN_N_IR_TEFF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TEFF */
#define IFX_CAN_N_IR_TEFF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TEFF */
#define IFX_CAN_N_IR_TEFF_OFF (14u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TEFL */
#define IFX_CAN_N_IR_TEFL_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TEFL */
#define IFX_CAN_N_IR_TEFL_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TEFL */
#define IFX_CAN_N_IR_TEFL_OFF (15u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TSW */
#define IFX_CAN_N_IR_TSW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TSW */
#define IFX_CAN_N_IR_TSW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TSW */
#define IFX_CAN_N_IR_TSW_OFF (16u)

/** \brief Length for Ifx_CAN_N_IR_Bits.MRAF */
#define IFX_CAN_N_IR_MRAF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.MRAF */
#define IFX_CAN_N_IR_MRAF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.MRAF */
#define IFX_CAN_N_IR_MRAF_OFF (17u)

/** \brief Length for Ifx_CAN_N_IR_Bits.TOO */
#define IFX_CAN_N_IR_TOO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.TOO */
#define IFX_CAN_N_IR_TOO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.TOO */
#define IFX_CAN_N_IR_TOO_OFF (18u)

/** \brief Length for Ifx_CAN_N_IR_Bits.DRX */
#define IFX_CAN_N_IR_DRX_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.DRX */
#define IFX_CAN_N_IR_DRX_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.DRX */
#define IFX_CAN_N_IR_DRX_OFF (19u)

/** \brief Length for Ifx_CAN_N_IR_Bits.ELO */
#define IFX_CAN_N_IR_ELO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.ELO */
#define IFX_CAN_N_IR_ELO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.ELO */
#define IFX_CAN_N_IR_ELO_OFF (22u)

/** \brief Length for Ifx_CAN_N_IR_Bits.EP */
#define IFX_CAN_N_IR_EP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.EP */
#define IFX_CAN_N_IR_EP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.EP */
#define IFX_CAN_N_IR_EP_OFF (23u)

/** \brief Length for Ifx_CAN_N_IR_Bits.EW */
#define IFX_CAN_N_IR_EW_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.EW */
#define IFX_CAN_N_IR_EW_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.EW */
#define IFX_CAN_N_IR_EW_OFF (24u)

/** \brief Length for Ifx_CAN_N_IR_Bits.BO */
#define IFX_CAN_N_IR_BO_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.BO */
#define IFX_CAN_N_IR_BO_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.BO */
#define IFX_CAN_N_IR_BO_OFF (25u)

/** \brief Length for Ifx_CAN_N_IR_Bits.WDI */
#define IFX_CAN_N_IR_WDI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.WDI */
#define IFX_CAN_N_IR_WDI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.WDI */
#define IFX_CAN_N_IR_WDI_OFF (26u)

/** \brief Length for Ifx_CAN_N_IR_Bits.PEA */
#define IFX_CAN_N_IR_PEA_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IR_Bits.PEA */
#define IFX_CAN_N_IR_PEA_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IR_Bits.PEA */
#define IFX_CAN_N_IR_PEA_OFF (27u)

