valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.PEAE */
#define IFX_CAN_N_IE_PEAE_OFF (27u)

/** \brief Length for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_IE_Bits.PEDE */
#define IFX_CAN_N_IE_PEDE_OFF (28u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.RRFE */
#define IFX_CAN_N_GFC_RRFE_OFF (0u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.RRFS */
#define IFX_CAN_N_GFC_RRFS_OFF (1u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_LEN (2u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.ANFE */
#define IFX_CAN_N_GFC_ANFE_OFF (2u)

/** \brief Length for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_GFC_Bits.ANFS */
#define IFX_CAN_N_GFC_ANFS_OFF (4u)

/** \brief Length for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_SIDFC_Bits.FLSSA */
#define IFX_CAN_N_SIDFC_FLSSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_LEN (8u)

/** \brief Mask for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_SIDFC_Bits.LSS */
#define IFX_CAN_N_SIDFC_LSS_OFF (16u)

/** \brief Length for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_XIDFC_Bits.FLESA */
#define IFX_CAN_N_XIDFC_FLESA_OFF (2u)

/** \brief Length for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_LEN (7u)

/** \brief Mask for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_XIDFC_Bits.LSE */
#define IFX_CAN_N_XIDFC_LSE_OFF (16u)

/** \brief Length for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_LEN (29u)

/** \brief Mask for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_N_XIDAM_Bits.EIDM */
#define IFX_CAN_N_XIDAM_EIDM_OFF (0u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_LEN (6u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.BIDX */
#define IFX_CAN_N_HPMS_BIDX_OFF (0u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_LEN (2u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.MSI */
#define IFX_CAN_N_HPMS_MSI_OFF (6u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_LEN (7u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.FIDX */
#define IFX_CAN_N_HPMS_FIDX_OFF (8u)

/** \brief Length for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_LEN (1u)

/** \brief Mask for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_HPMS_Bits.FLST */
#define IFX_CAN_N_HPMS_FLST_OFF (15u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND0 */
#define IFX_CAN_N_NDAT1_ND0_OFF (0u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND1 */
#define IFX_CAN_N_NDAT1_ND1_OFF (1u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND2 */
#define IFX_CAN_N_NDAT1_ND2_OFF (2u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND3 */
#define IFX_CAN_N_NDAT1_ND3_OFF (3u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND4 */
#define IFX_CAN_N_NDAT1_ND4_OFF (4u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND5 */
#define IFX_CAN_N_NDAT1_ND5_OFF (5u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND6 */
#define IFX_CAN_N_NDAT1_ND6_OFF (6u)

/** \brief Length for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT1_Bits.ND7 */
#define IFX_CAN_N_NDAT1_ND7_OFF (7u)

