valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND60 */
#define IFX_CAN_N_NDAT2_ND60_OFF (28u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND61 */
#define IFX_CAN_N_NDAT2_ND61_OFF (29u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND62 */
#define IFX_CAN_N_NDAT2_ND62_OFF (30u)

/** \brief Length for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NDAT2_Bits.ND63 */
#define IFX_CAN_N_NDAT2_ND63_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0SA */
#define IFX_CAN_N_RX_F0C_F0SA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0S */
#define IFX_CAN_N_RX_F0C_F0S_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0WM */
#define IFX_CAN_N_RX_F0C_F0WM_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0C_Bits.F0OM */
#define IFX_CAN_N_RX_F0C_F0OM_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0FL */
#define IFX_CAN_N_RX_F0S_F0FL_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0GI */
#define IFX_CAN_N_RX_F0S_F0GI_OFF (8u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0PI */
#define IFX_CAN_N_RX_F0S_F0PI_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.F0F */
#define IFX_CAN_N_RX_F0S_F0F_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F0S_Bits.RF0L */
#define IFX_CAN_N_RX_F0S_RF0L_OFF (25u)

/** \brief Length for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F0A_Bits.F0AI */
#define IFX_CAN_N_RX_F0A_F0AI_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_BC_Bits.RBSA */
#define IFX_CAN_N_RX_BC_RBSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1SA */
#define IFX_CAN_N_RX_F1C_F1SA_OFF (2u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1S */
#define IFX_CAN_N_RX_F1C_F1S_OFF (16u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1WM */
#define IFX_CAN_N_RX_F1C_F1WM_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1C_Bits.F1OM */
#define IFX_CAN_N_RX_F1C_F1OM_OFF (31u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_LEN (7u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1FL */
#define IFX_CAN_N_RX_F1S_F1FL_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1GI */
#define IFX_CAN_N_RX_F1S_F1GI_OFF (8u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1PI */
#define IFX_CAN_N_RX_F1S_F1PI_OFF (16u)

