valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOneTime/Libraries/Infra/Sfr/TC33x/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE16 */
#define IFX_CAN_N_TX_BCIE_CFIE16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE17 */
#define IFX_CAN_N_TX_BCIE_CFIE17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE18 */
#define IFX_CAN_N_TX_BCIE_CFIE18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE19 */
#define IFX_CAN_N_TX_BCIE_CFIE19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE20 */
#define IFX_CAN_N_TX_BCIE_CFIE20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE21 */
#define IFX_CAN_N_TX_BCIE_CFIE21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE22 */
#define IFX_CAN_N_TX_BCIE_CFIE22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE23 */
#define IFX_CAN_N_TX_BCIE_CFIE23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE24 */
#define IFX_CAN_N_TX_BCIE_CFIE24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE25 */
#define IFX_CAN_N_TX_BCIE_CFIE25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE26 */
#define IFX_CAN_N_TX_BCIE_CFIE26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE27 */
#define IFX_CAN_N_TX_BCIE_CFIE27_OFF (27u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE28 */
#define IFX_CAN_N_TX_BCIE_CFIE28_OFF (28u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE29 */
#define IFX_CAN_N_TX_BCIE_CFIE29_OFF (29u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE30 */
#define IFX_CAN_N_TX_BCIE_CFIE30_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BCIE_Bits.CFIE31 */
#define IFX_CAN_N_TX_BCIE_CFIE31_OFF (31u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFSA */
#define IFX_CAN_N_TX_EFC_EFSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFS */
#define IFX_CAN_N_TX_EFC_EFS_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFC_Bits.EFWM */
#define IFX_CAN_N_TX_EFC_EFWM_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFFL */
#define IFX_CAN_N_TX_EFS_EFFL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_EFS_Bits.EFGI */
#define IFX_CAN_N_TX_EFS_EFGI_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_EFS_Bits.EFPI */
#define IFX_CAN_N_TX_EFS_EFPI_MSK (0x1fu)

